package common

var (
	// 账号查询映射
	QueryAccountMap = map[string]int64{
		"175化生寺": 1,
		"175大唐":  2,
		"175五庄观": 3,
	}
)

var (
	QueryQNameMapAttribute = map[string]string{
		"武器": "武器",
		"刀":  "武器",
		"剑":  "武器",
		"衣服": "衣服",
		"铠甲": "衣服",
		"鞋子": "鞋子",
		"鞋":  "鞋子",
		"靴子": "鞋子",
		"项链": "项链",
		"链子": "项链",
		"腰带": "腰带",
		"帽子": "帽子",
		"头":  "帽子",
		"戒指": "戒指",
		"耳饰": "耳饰",
		"耳环": "耳饰",
		"佩饰": "佩饰",
		"玉佩": "佩饰",
		"手镯": "手镯",
		"镯子": "手镯",
	}

	QueryNameMapAttribute = map[string]string{}
)

// 查询时简称对应的精准查询字符串映射Map
var (
	QueryQNameMapStuff = map[string]string{
		"元宵":   "元宵",
		"66":   "金柳露",
		"6":    "金柳露",
		"金柳露":  "金柳露",
		"宝图":   "宝图",
		"图":    "宝图",
		"光芒":   "光芒石",
		"光芒石":  "光芒石",
		"舍利":   "舍利子",
		"舍利子":  "舍利子",
		"黑宝石":  "黑宝石",
		"玛瑙":   "红玛瑙",
		"红玛瑙":  "红玛瑙",
		"太阳石":  "太阳石",
		"太阳":   "太阳石",
		"月亮石":  "月亮石",
		"月亮":   "月亮石",
		"星辉石":  "星辉石",
		"星辉":   "星辉石",
		"珍珠":   "珍珠",
		"如意丹":  "如意丹",
		"如意":   "如意丹",
		"精铁":   "精铁",
		"铁":    "精铁",
		"晶石":   "晶石",
		"晶":    "晶石",
		"戒指指南": "戒指灵饰指南",
		"耳饰指南": "耳饰灵饰指南",
		"佩饰指南": "佩饰灵饰指南",
		"手镯指南": "手镯灵饰指南",
	}

	QueryNameMapStuff = map[string]string{
		"c66": "超级金柳露",
		"高宝图": "高级宝图",
		"低宝图": "低级宝图",
	}
)
